{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 700, 22], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "c3_0", "class_name": "Conv1D", "config": {"name": "c3_0", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "c7_0", "class_name": "Conv1D", "config": {"name": "c7_0", "trainable": true, "filters": 64, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "c9_0", "class_name": "Conv1D", "config": {"name": "c9_0", "trainable": true, "filters": 64, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conc_0", "class_name": "Concatenate", "config": {"name": "conc_0", "trainable": true, "axis": -1}, "inbound_nodes": [[["c3_0", 0, 0, {}], ["c7_0", 0, 0, {}], ["c9_0", 0, 0, {}]]]}, {"name": "bn_0", "class_name": "BatchNormalization", "config": {"name": "bn_0", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conc_0", 0, 0, {}]]]}, {"name": "drop_0", "class_name": "Dropout", "config": {"name": "drop_0", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bn_0", 0, 0, {}]]]}, {"name": "relu_0", "class_name": "Activation", "config": {"name": "relu_0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["drop_0", 0, 0, {}]]]}, {"name": "cc9_0", "class_name": "Conv1D", "config": {"name": "cc9_0", "trainable": true, "filters": 27, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_0", 0, 0, {}]]]}, {"name": "bn2_0", "class_name": "BatchNormalization", "config": {"name": "bn2_0", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["cc9_0", 0, 0, {}]]]}, {"name": "drop2_0", "class_name": "Dropout", "config": {"name": "drop2_0", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bn2_0", 0, 0, {}]]]}, {"name": "c1_0", "class_name": "Conv1D", "config": {"name": "c1_0", "trainable": true, "filters": 36, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "relu2_0", "class_name": "Activation", "config": {"name": "relu2_0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["drop2_0", 0, 0, {}]]]}, {"name": "conc2_0", "class_name": "Concatenate", "config": {"name": "conc2_0", "trainable": true, "axis": -1}, "inbound_nodes": [[["c1_0", 0, 0, {}], ["relu_0", 0, 0, {}], ["relu2_0", 0, 0, {}]]]}, {"name": "c3_1", "class_name": "Conv1D", "config": {"name": "c3_1", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conc2_0", 0, 0, {}]]]}, {"name": "c7_1", "class_name": "Conv1D", "config": {"name": "c7_1", "trainable": true, "filters": 64, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conc2_0", 0, 0, {}]]]}, {"name": "c9_1", "class_name": "Conv1D", "config": {"name": "c9_1", "trainable": true, "filters": 64, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conc2_0", 0, 0, {}]]]}, {"name": "conc_1", "class_name": "Concatenate", "config": {"name": "conc_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["c3_1", 0, 0, {}], ["c7_1", 0, 0, {}], ["c9_1", 0, 0, {}]]]}, {"name": "bn_1", "class_name": "BatchNormalization", "config": {"name": "bn_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conc_1", 0, 0, {}]]]}, {"name": "drop_1", "class_name": "Dropout", "config": {"name": "drop_1", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bn_1", 0, 0, {}]]]}, {"name": "relu_1", "class_name": "Activation", "config": {"name": "relu_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["drop_1", 0, 0, {}]]]}, {"name": "cc9_1", "class_name": "Conv1D", "config": {"name": "cc9_1", "trainable": true, "filters": 27, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_1", 0, 0, {}]]]}, {"name": "bn2_1", "class_name": "BatchNormalization", "config": {"name": "bn2_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["cc9_1", 0, 0, {}]]]}, {"name": "drop2_1", "class_name": "Dropout", "config": {"name": "drop2_1", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bn2_1", 0, 0, {}]]]}, {"name": "c1_1", "class_name": "Conv1D", "config": {"name": "c1_1", "trainable": true, "filters": 36, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conc2_0", 0, 0, {}]]]}, {"name": "relu2_1", "class_name": "Activation", "config": {"name": "relu2_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["drop2_1", 0, 0, {}]]]}, {"name": "conc2_1", "class_name": "Concatenate", "config": {"name": "conc2_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["c1_1", 0, 0, {}], ["relu_1", 0, 0, {}], ["relu2_1", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "d_0", "trainable": true, "units": 455, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conc2_1", 0, 0, {}]]]}, {"name": "bnd_0", "class_name": "BatchNormalization", "config": {"name": "bnd_0", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "d_dropout_0", "class_name": "Dropout", "config": {"name": "d_dropout_0", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bnd_0", 0, 0, {}]]]}, {"name": "relu_d_0", "class_name": "Activation", "config": {"name": "relu_d_0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["d_dropout_0", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 9, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["relu_d_0", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["time_distributed_2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}