{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 700, 22], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_11", "class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_12", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_22", "class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_24", "class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_25", "class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_26", "class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_27", "class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_28", "class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_29", "class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_30", "class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_31", "class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "lambda_32", "class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyYAAAB8AGQAZACFAmQAZACFAogAZAEUAIgAZAEUAGQBFwCF\nAmYDGQBTACkCTukCAAAAqQApAdoBeCkB2gFpcgIAAAD6C3RpbnlfY25uLnB52gg8bGFtYmRhPigB\nAADzAAAAAA==\n", null, [31]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "conv1d_6", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"name": "conv1d_7", "class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"name": "conv1d_8", "class_name": "Conv1D", "config": {"name": "conv1d_8", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"name": "conv1d_9", "class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_8", 0, 0, {}]]]}, {"name": "conv1d_10", "class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_9", 0, 0, {}]]]}, {"name": "conv1d_11", "class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"name": "conv1d_12", "class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_11", 0, 0, {}]]]}, {"name": "conv1d_13", "class_name": "Conv1D", "config": {"name": "conv1d_13", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_12", 0, 0, {}]]]}, {"name": "conv1d_14", "class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"name": "conv1d_15", "class_name": "Conv1D", "config": {"name": "conv1d_15", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_14", 0, 0, {}]]]}, {"name": "conv1d_16", "class_name": "Conv1D", "config": {"name": "conv1d_16", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_15", 0, 0, {}]]]}, {"name": "conv1d_17", "class_name": "Conv1D", "config": {"name": "conv1d_17", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_16", 0, 0, {}]]]}, {"name": "conv1d_18", "class_name": "Conv1D", "config": {"name": "conv1d_18", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_17", 0, 0, {}]]]}, {"name": "conv1d_19", "class_name": "Conv1D", "config": {"name": "conv1d_19", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_18", 0, 0, {}]]]}, {"name": "conv1d_20", "class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_19", 0, 0, {}]]]}, {"name": "conv1d_21", "class_name": "Conv1D", "config": {"name": "conv1d_21", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_20", 0, 0, {}]]]}, {"name": "conv1d_22", "class_name": "Conv1D", "config": {"name": "conv1d_22", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_21", 0, 0, {}]]]}, {"name": "conv1d_23", "class_name": "Conv1D", "config": {"name": "conv1d_23", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_22", 0, 0, {}]]]}, {"name": "conv1d_24", "class_name": "Conv1D", "config": {"name": "conv1d_24", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_23", 0, 0, {}]]]}, {"name": "conv1d_25", "class_name": "Conv1D", "config": {"name": "conv1d_25", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_24", 0, 0, {}]]]}, {"name": "conv1d_26", "class_name": "Conv1D", "config": {"name": "conv1d_26", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_25", 0, 0, {}]]]}, {"name": "conv1d_27", "class_name": "Conv1D", "config": {"name": "conv1d_27", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_26", 0, 0, {}]]]}, {"name": "conv1d_28", "class_name": "Conv1D", "config": {"name": "conv1d_28", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_27", 0, 0, {}]]]}, {"name": "conv1d_29", "class_name": "Conv1D", "config": {"name": "conv1d_29", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_28", 0, 0, {}]]]}, {"name": "conv1d_30", "class_name": "Conv1D", "config": {"name": "conv1d_30", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_29", 0, 0, {}]]]}, {"name": "conv1d_31", "class_name": "Conv1D", "config": {"name": "conv1d_31", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_30", 0, 0, {}]]]}, {"name": "conv1d_32", "class_name": "Conv1D", "config": {"name": "conv1d_32", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_31", 0, 0, {}]]]}, {"name": "conv1d_33", "class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "filters": 2, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_32", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv1d_2", 0, 0, {}], ["conv1d_3", 0, 0, {}], ["conv1d_4", 0, 0, {}], ["conv1d_5", 0, 0, {}], ["conv1d_6", 0, 0, {}], ["conv1d_7", 0, 0, {}], ["conv1d_8", 0, 0, {}], ["conv1d_9", 0, 0, {}], ["conv1d_10", 0, 0, {}], ["conv1d_11", 0, 0, {}], ["conv1d_12", 0, 0, {}], ["conv1d_13", 0, 0, {}], ["conv1d_14", 0, 0, {}], ["conv1d_15", 0, 0, {}], ["conv1d_16", 0, 0, {}], ["conv1d_17", 0, 0, {}], ["conv1d_18", 0, 0, {}], ["conv1d_19", 0, 0, {}], ["conv1d_20", 0, 0, {}], ["conv1d_21", 0, 0, {}], ["conv1d_22", 0, 0, {}], ["conv1d_23", 0, 0, {}], ["conv1d_24", 0, 0, {}], ["conv1d_25", 0, 0, {}], ["conv1d_26", 0, 0, {}], ["conv1d_27", 0, 0, {}], ["conv1d_28", 0, 0, {}], ["conv1d_29", 0, 0, {}], ["conv1d_30", 0, 0, {}], ["conv1d_31", 0, 0, {}], ["conv1d_32", 0, 0, {}], ["conv1d_33", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 9, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["time_distributed_2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}